OpenDTEF-v2012/tutorials/preProcessing/PDRsetFields/simplePipeCage/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    outer
    {
        type            waveTransmissive;
        gamma           1.3;
        fieldInf        100000;
        lInf            5;
        value           $internalField;
    }
    ground
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            zeroGradient;
    }
    mergingFaces
    {
        type            zeroGradient;
    }
    wallFaces
    {
        type            zeroGradient;
    }
    ySymmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
