OpenDTEF-v2012/tutorials/preProcessing/PDRsetFields/simplePipeCage/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    outer
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    ground
    {
        type            compressible::epsilonWallFunction;
    }
    blockedFaces
    {
        type            zeroGradient;
    }
    mergingFaces
    {
        type            compressible::epsilonWallFunction;
    }
    wallFaces
    {
        type            compressible::epsilonWallFunction;
    }
    ySymmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
